app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks"
---
  def index
    respond_with Stock.all

INSERT INTO "stocks" ("created_at", "name", "symbol", "updated_at", "year_heigh", "year_low") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2014-08-24 18:48:09.268933"], ["name", "Novo Nordisk A/S"], ["symbol", "NVO"], ["updated_at", "2014-08-24 18:48:09.268933"], ["year_heigh", 48.42], ["year_low", 32.2]]
---
  def create
    respond_with Stock.create(stock_params)

DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 1]]
---
  def destroy
    respond_with Stock.destroy(params[:id])